Revit 2027 API
NumberingSchema.GetNumberingInfoForReferences Method
 Get all the ElementInfos from a given document related to a set of references.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<NumberedReferenceInfo> GetNumberingInfoForReferences(
	Document document,
	IList<Reference> references
)
Public Shared Function GetNumberingInfoForReferences (
	document As Document,
	references As IList(Of Reference)
) As IList(Of NumberedReferenceInfo)
public:
static IList<NumberedReferenceInfo^>^ GetNumberingInfoForReferences(
	Document^ document,
	IList<Reference^>^ references
)
static member GetNumberingInfoForReferences :
        document : Document *
        references : IList<Reference> -> IList<NumberedReferenceInfo>
Parameters
document Document
references IList<Reference>
 References that represent the target elements.
Return Value
IList<NumberedReferenceInfo>
Exceptions
Exception | Condition
ArgumentException |  Can't access the number while an async operation is running.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
NumberingSchema Class
Autodesk.Revit.DB Namespace